import img1 from '../../assets/images/thumb_read01.jpg';
import img2 from '../../assets/images/thumb_read02.jpg';
import img3 from '../../assets/images/thumb_read03.jpg';
import img4 from '../../assets/images/thumb_read04.jpg';

const newsVideo = [
    {
        newsTopic: '30 เซ็ตติ้งและธีมยอดนิยมในวิดีโอเกมส์',
        content: 'ฉากหลังหรือ Setting จัดเป็นอีกหนึ่งหัวใจหลักของวิดีโอเกม เป็นแกนหลักในการเล่าเรื่องราว เป็นหัวใจสำคัญในการสร้างความน่าติดตาม ให้กับผู้เล่นที่ได้สัมผัส ซึ่งตัวฉากหลังนั้นก็มีหลากหลายแนวมีหลายรูปรวมไปถึงถูกนำมาผสมหรือดัดแปลงปรับเปลี่ยนเพื่อสร้างสรรค์ออกมา เป็นสุดยอดผลงานเกมที่เราได้เล่นกันซึ่งฉากหลังที่มีในวิดีโอเกมก็มีหลายรูปแบบหลายแนว ซึ่งจะรวมมาทั้งหมดก็อาจจะไม่ไหว',
        img: img1,  
    },
    {
        newsTopic: 'นักพัฒนาเกมบน Stadia ต่างก็ “ช็อค” กับข่าวปิด ตัวกะทันหัน เพราะ Google ไม่ได้แจ้งค่าย เกมไว้ล่วงหน้า',
        content: '',
        img: img2,  
    },
    {
        newsTopic: 'นักพัฒนาเกมบน Stadia ต่างก็ “ช็อค” กับข่าวปิด ตัวกะทันหัน เพราะ Google ไม่ได้แจ้งค่าย เกมไว้ล่วงหน้า',
        content: '',
        img: img3,  
    },
    {
        newsTopic: 'นักพัฒนาเกมบน Stadia ต่างก็ “ช็อค” กับข่าวปิด ตัวกะทันหัน เพราะ Google ไม่ได้แจ้งค่าย เกมไว้ล่วงหน้า',
        content: '',
        img: img2,  
    },
    {
        newsTopic: 'นักพัฒนาเกมบน Stadia ต่างก็ “ช็อค” กับข่าวปิด ตัวกะทันหัน เพราะ Google ไม่ได้แจ้งค่าย เกมไว้ล่วงหน้า',
        content: '',
        img: img4,  
    },
];

export default newsVideo;